/*
///////////////////////////////////////////////////////////////////////////////
//
//  FileName    :   zend_dump.c
//  Version     :   1.0
//  Creator     :   RM
//  Create Date :   2006-01-01
//  Comment     :
//
///////////////////////////////////////////////////////////////////////////////
*/

#include < tchar.h >
#include < time.h >
#include "zend.h"
#include "zend_extensions.h"
#include "zend_modules.h"
#include "zend_variables.h"
#include "zend_constants.h"
#include "zend_globals_macros.h"
#include "zend_list.h"
#include "zend_ptr_stack.h"
#include "zend_API.h"
#include "zend_ini.h"
#include "zend_compile.h"
#include "zend_execute.h"

#include "Macro.h"
#include "Compatible.h"
#include "Encode.h"
#include "Dump.h"
#include "AddLog.h"
#include "Base64X.h"
#include "Utf8.h"
#include "ListEntry.h"
#include "Stack.h"
#include "ParseString.h"
#include "ParseSetting.h"
#include "Patch.h"
#include "zend_dump.h"

#ifdef _MSC_VER

/* Skip warning */
#pragma warning( disable: 4054 )
#pragma warning( disable: 4055 )
#pragma warning( disable: 4100 )
#pragma warning( disable: 4127 )
#pragma warning( disable: 4152 )
#pragma warning( disable: 4201 )
#pragma warning( disable: 4204 )
#pragma warning( disable: 4245 )
#pragma warning( disable: 4310 )
#pragma warning( disable: 4505 )
#pragma warning( disable: 4706 )

/* Heap reserve size 4194304bytes( =4M ) */
#pragma comment( linker, "/HEAP:4194304" )

#endif

/*

#define TEST_ALL_VAR( Node ) ( ( Node )->op_type & ( IS_VAR | IS_TMP_VAR | IS_CV ) )

#define TEST_NUMBER( Node ) ( ( Node )->u.constant.type == IS_LONG || ( Node )->u.constant.type == IS_DOUBLE )

#define TEST_OP1_CONST( OpLine ) TEST_CONST( &OpLine->op1 )
#define TEST_OP2_CONST( OpLine ) TEST_CONST( &OpLine->op2 )
#define TEST_OPR_CONST( OpLine ) TEST_CONST( &OpLine->result )

#define TEST_OP1_TMP_VAR( OpLine ) TEST_TMP_VAR( &OpLine->op1 )
#define TEST_OP2_TMP_VAR( OpLine ) TEST_TMP_VAR( &OpLine->op2 )
#define TEST_OPR_TMP_VAR( OpLine ) TEST_TMP_VAR( &OpLine->result )

#define TEST_OP1_CMP_VAR( OpLine ) TEST_CMP_VAR( &OpLine->op1 )
#define TEST_OP2_CMP_VAR( OpLine ) TEST_CMP_VAR( &OpLine->op2 )
#define TEST_OPR_CMP_VAR( OpLine ) TEST_CMP_VAR( &OpLine->result )

#define TEST_OP1_ALL_VAR( OpLine ) TEST_ALL_VAR( &OpLine->op1 )
#define TEST_OP2_ALL_VAR( OpLine ) TEST_ALL_VAR( &OpLine->op2 )
#define TEST_OPR_ALL_VAR( OpLine ) TEST_ALL_VAR( &OpLine->result )

#define TEST_OP1_NUMBER( OpLine ) TEST_NUMBER( &OpLine->op1 )
#define TEST_OP2_NUMBER( OpLine ) TEST_NUMBER( &OpLine->op2 )
#define TEST_OPR_NUMBER( OpLine ) TEST_NUMBER( &OpLine->result )

/* Var string map key */
#define MAKE_KEY( Type, Var ) ( ( ( Type ) << 16 ) | ( Var ) )

/* Macro */
#define TSRMG_GET( Id ) ( *( ( void*** )TSRMLS_C ) )[TSRM_UNSHUFFLE_RSRC_ID( Id )]
#define TSRMG_GET_EX( TsrmLs, Id ) ( *( ( void*** )TsrmLs ) )[TSRM_UNSHUFFLE_RSRC_ID( Id )]

/* Encode/decode hash */
#define ENCODE_HASH_KEY 0x80000000
#define ENCODE_HASH( Data ) ( ( Data ) | ENCODE_HASH_KEY )
#define DECODE_HASH( Data ) ( ( Data ) & ~ENCODE_HASH_KEY )

/* Lock flags */
#define FLAGS_LOCKED 0x80000000

/* Logic prefix flags */
#define LL_FLAGS_TOP 0x10000000

/* Brk_cont list flags */
#define BL_FLAGS_SPECIAL 0x80000000

/* Logic op type */
#define OT_BOOL_AND 0
#define OT_BOOL_OR 1
#define OT_LG_AND 2
#define OT_LG_OR 3

/* Map flags */
#define FLAGS_OFFSET_MAP 0x80000000

/* Scan flags */
#define FLAGS_NEST 0x1
#define FLAGS_RETURN 0x2

#define FLAGS_NEST_RETURN ( FLAGS_NEST | FLAGS_RETURN )

/* Jmpx flags */
#define FLAGS_JMPX_SPECIAL 0x1
#define FLAGS_JMPX_MAP 0x2
#define FLAGS_JMPX_BRK 0x4
#define FLAGS_JMPX_CONT 0x8

#define FLAGS_JMPX_MAP_1 0x10003
#define FLAGS_JMPX_MAP_2 0x20003
#define FLAGS_JMPX_MAP_3 0x40003
#define FLAGS_JMPX_MAP_SWITCH 0x80003

/*
///////////////////////////////////////////////////////////////////////////////
// S T R U C T U R E S
///////////////////////////////////////////////////////////////////////////////
*/
typedef zend_op_array* ( *COMPILE_PROC ) ( zend_file_handle *, int TSRMLS_DC );
typedef void ( *EXECUTE_PROC ) ( zend_op_array* TSRMLS_DC );
typedef void ( *HANDLER_1 ) ( int ht, zval *return_value, zval *this_ptr, int return_value_used TSRMLS_DC );
typedef void ( *HANDLER_2 ) ( int ht, zval *return_value, zval **return_value_ptr, zval *this_ptr, int return_value_used TSRMLS_DC );
typedef int ( *opcode_handler_t_2 ) ( zend_execute_data *execute_data TSRMLS_DC );

typedef struct _znode_x {
    int op_type;
    union {
        zval constant;
        zend_uint var;
        zend_uint opline_num; /* Needs to be signed */
        zend_uint fetch_type;
        zend_op_array *op_array;
        zend_op *jmp_addr;
        struct {
            zend_uint var; /* dummy */
            zend_uint type;
        } EA;
    } u;
} znode_x;

typedef struct _zend_op_1 {
    zend_uchar opcode;
    znode_x result;
    znode_x op1;
    znode_x op2;
    ulong extended_value;
    uint lineno;
} zend_op_1;

typedef struct _zend_op_array_1 {
    zend_uchar type; /* MUST be the first element of this struct! */

    zend_uchar *arg_types; /* MUST be the second element of this struct! */
    TCHAR *function_name; /* MUST be the third element of this struct! */

    zend_uint *refcount;

    zend_op_1 *opcodes;
    zend_uint last, size;

    zend_uint T;

    zend_brk_cont_element *brk_cont_array;
    zend_uint last_brk_cont;
    zend_uint current_brk_cont;
    zend_bool uses_globals;

    /* static variables support */
    HashTable *static_variables;

    zend_op_1 *start_op;
    int backpatch_count;

    zend_bool return_reference;
    zend_bool done_pass_two;

    TCHAR *filename;

    void *reserved[ZEND_MAX_RESERVED_RESOURCES];
} zend_op_array_1;

typedef union _zvalue_value_1 {
    long lval; /* long value */
    double dval; /* double value */
    struct {
        TCHAR *val;
        int len;
    } str;
    HashTable *ht; /* hash table value */
    zend_object obj;
} zvalue_value_1;

typedef struct _zval_1 {
    /* Variable information */
    zvalue_value_1 value; /* value */
    zend_uint refcount;
    zend_uchar type; /* active type */
    zend_uchar is_ref;
} zval_1;

typedef struct _zend_overloaded_function_1 {
    zend_uchar type; /* MUST be the first element of this struct! */
    zend_uchar *arg_types; /* MUST be the second element of this struct */
    TCHAR *function_name; /* MUST be the third element of this struct */
    zend_uint var;
} zend_overloaded_function_1;

typedef union _zend_function_1 {
    zend_uchar type; /* MUST be the first element of this struct! */
    struct {
        zend_uchar type; /* never used */
        zend_uchar *arg_types;
        TCHAR *function_name;
    } common;

    zend_op_array_1 op_array;
    zend_internal_function internal_function;
    zend_overloaded_function_1 overloaded_function;
} zend_function_1;

typedef struct _zend_class_entry_1 {
    TCHAR type;
    TCHAR *name;
    uint name_length;
    struct _zend_class_entry_1 *parent;
    int *refcount;
    zend_bool constants_updated;

    HashTable function_table;
    HashTable default_properties;
    zend_function_entry *builtin_functions;

    /* handlers */
    PVOID handle_function_call;
    PVOID handle_property_get;
    PVOID handle_property_set;
} zend_class_entry_1;

typedef struct _zend_compiler_globals_1 {
    zend_stack bp_stack;
    zend_stack switch_cond_stack;
    zend_stack foreach_copy_stack;
    zend_stack object_stack;
    zend_stack declare_stack;

    zend_class_entry_1 class_entry, *active_class_entry;
    zval_1 active_ce_parent_class_name;

    /* variables for list() compilation */
    zend_llist list_llist;
    zend_llist dimension_llist;
    zend_stack list_stack;

    zend_stack function_call_stack;

    TCHAR *compiled_filename;

    int zend_lineno;
    int comment_start_line;
    TCHAR *heredoc;
    int heredoc_len;

    zend_op_array_1 *active_op_array;

    HashTable *function_table; /* function symbol table */
    HashTable *class_table; /* class table */

    HashTable filenames_table;

    HashTable *auto_globals;

    zend_bool in_compilation;
    zend_bool short_tags;
    zend_bool asp_tags;
    zend_bool allow_call_time_pass_reference;

    zend_declarables declarables;

    /* For extensions support */
    zend_bool extended_info; /* generate extension information for debugger/profiler */
    zend_bool handle_op_arrays; /* run op_arrays through op_array handlers */

    zend_bool unclean_shutdown;

    zend_bool ini_parser_unbuffered_errors;

    zend_llist open_files;

    struct _zend_ini_parser_param *ini_parser_param;

    int interactive;

    zend_bool increment_lineno;

#ifdef ZEND_MULTIBYTE
    zend_encoding **script_encoding_list;
    int script_encoding_list_size;

    zend_encoding *internal_encoding;

    zend_encoding_detector encoding_detector;
    zend_encoding_converter encoding_converter;
    zend_multibyte_oddlen multibyte_oddlen;
#endif /* ZEND_MULTIBYTE */
} zend_compiler_globals_1;

typedef struct _zend_executor_globals_1 {
    zval **return_value_ptr_ptr;

    zval uninitialized_zval;
    zval *uninitialized_zval_ptr;

    zval error_zval;
    zval *error_zval_ptr;

    zend_function_state *function_state_ptr;
    zend_ptr_stack arg_types_stack;

    /* symbol table cache */
    HashTable *symtable_cache[SYMTABLE_CACHE_SIZE];
    HashTable **symtable_cache_limit;
    HashTable **symtable_cache_ptr;

    zend_op **opline_ptr;

    zend_execute_data *current_execute_data;

    HashTable *active_symbol_table;
    HashTable symbol_table; /* main symbol table */

    HashTable included_files; /* files already included */

    jmp_buf bailout;

    int error_reporting;
    int orig_error_reporting;
    int exit_status;

    zend_op_array *active_op_array;

    HashTable *function_table; /* function symbol table */
    HashTable *class_table; /* class table */
    HashTable *zend_constants; /* constants table */

    long precision;

    int ticks_count;

    zend_bool in_execution;
    zend_bool bailout_set;
    zend_bool full_tables_cleanup;

    /* for extended information support */
    zend_bool no_extensions;

#ifdef ZEND_WIN32
    zend_bool timed_out;
#endif

    HashTable regular_list;
    HashTable persistent_list;

    zend_ptr_stack argument_stack;
    int free_op1, free_op2;
    int ( *unary_op ) ( zval *result, zval *op1 );
    int ( *binary_op ) ( zval *result, zval *op1, zval *op2 TSRMLS_DC );

    zval *garbage[2];
    int garbage_ptr;

    zval *user_error_handler;
    zend_ptr_stack user_error_handlers;

    /* timeout support */
    int timeout_seconds;

    int lambda_count;

    HashTable *ini_directives;

    void *reserved[ZEND_MAX_RESERVED_RESOURCES];
} zend_executor_globals_1;

typedef struct _zend_op_2 {
    void *handler;
    znode_x result;
    znode_x op1;
    znode_x op2;
    ulong extended_value;
    uint lineno;
    zend_uchar opcode;
} zend_op_2;

typedef struct _zend_property_info_2 {
    zend_uint flags;
    TCHAR *name;
    int name_length;
    ulong h;
    TCHAR *doc_comment;
    int doc_comment_len;
    struct _zend_class_entry_2 *ce;
} zend_property_info_2;

typedef struct _zend_arg_info_2 {
    TCHAR *name;
    zend_uint name_len;
    TCHAR *class_name;
    zend_uint class_name_len;
    zend_bool array_type_hint;
    zend_bool allow_null;
    zend_bool pass_by_reference;
    zend_bool return_reference;
    int required_num_args;
} zend_arg_info_2;

typedef struct _zend_compiled_variable_2 {
    TCHAR *name;
    int name_len;
    ulong hash_value;
} zend_compiled_variable_2;

typedef struct _zend_try_catch_element_2 {
    zend_uint try_op;
    zend_uint catch_op;
} zend_try_catch_element_2;

typedef struct _zend_op_array_2 {
    /* Common elements */
    zend_uchar type;
    TCHAR *function_name;
    zend_class_entry *scope;
    zend_uint fn_flags;
    union _zend_function_2 *prototype;
    zend_uint num_args;
    zend_uint required_num_args;
    zend_arg_info_2 *arg_info;
    zend_bool pass_rest_by_reference;
    unsigned char return_reference;
    /* END of common elements */

    zend_uint *refcount;

    zend_op_2 *opcodes;
    zend_uint last, size;

    zend_compiled_variable_2 *vars;
    int last_var, size_var;

    zend_uint T;

    zend_brk_cont_element *brk_cont_array;
    zend_uint last_brk_cont;
    zend_uint current_brk_cont;

    zend_try_catch_element_2 *try_catch_array;
    int last_try_catch;

    /* static variables support */
    HashTable *static_variables;

    zend_op_2 *start_op;
    int backpatch_count;

    zend_bool done_pass_two;
    zend_bool uses_this;

    TCHAR *filename;
    zend_uint line_start;
    zend_uint line_end;
    TCHAR *doc_comment;
    zend_uint doc_comment_len;

    void *reserved[ZEND_MAX_RESERVED_RESOURCES];
} zend_op_array_2;

typedef struct _zend_object_value_2 {
    unsigned int handle;
    void *handlers;
} zend_object_value_2;

typedef union _zvalue_value_2 {
    long lval; /* long value */
    double dval; /* double value */
    struct {
        TCHAR *val;
        int len;
    } str;
    HashTable *ht; /* hash table value */
    zend_object_value_2 obj;
} zvalue_value_2;

typedef struct _zval_2 {
    /* Variable information */
    zvalue_value_2 value; /* value */
    zend_uint refcount;
    zend_uchar type; /* active type */
    zend_uchar is_ref;
} zval_2;

typedef struct _zend_class_iterator_funcs_2 {
    PVOID *funcs;
    union _zend_function_2 *zf_new_iterator;
    union _zend_function_2 *zf_valid;
    union _zend_function_2 *zf_current;
    union _zend_function_2 *zf_key;
    union _zend_function_2 *zf_next;
    union _zend_function_2 *zf_rewind;
} zend_class_iterator_funcs_2;

typedef union _zend_function_2 {
    zend_uchar type; /* MUST be the first element of this struct! */

    struct {
        zend_uchar type; /* never used */
        TCHAR *function_name;
        zend_class_entry *scope;
        zend_uint fn_flags;
        union _zend_function *prototype;
        zend_uint num_args;
        zend_uint required_num_args;
        zend_arg_info_2 *arg_info;
        zend_bool pass_rest_by_reference;
        unsigned char return_reference;
    } common;

    zend_op_array_2 op_array;
    zend_internal_function internal_function;
} zend_function_2;

typedef struct _zend_class_entry_2 {
    TCHAR type;
    TCHAR *name;
    zend_uint name_length;
    struct _zend_class_entry_2 *parent;
    int refcount;
    zend_bool constants_updated;
    zend_uint ce_flags;

    HashTable function_table;
    HashTable default_properties;
    HashTable properties_info;
    HashTable default_static_members;
    HashTable *static_members;
    HashTable constants_table;
    struct _zend_function_entry *builtin_functions;

    union _zend_function_2 *constructor;
    union _zend_function_2 *destructor;
    union _zend_function_2 *clone;
    union _zend_function_2 *__get;
    union _zend_function_2 *__set;
    union _zend_function_2 *__unset;
    union _zend_function_2 *__isset;
    union _zend_function_2 *__call;
    union _zend_function_2 *__tostring;
    union _zend_function_2 *serialize_func;
    union _zend_function_2 *unserialize_func;

    zend_class_iterator_funcs_2 iterator_funcs;

    /* handlers */
    PVOID create_object;
    PVOID get_iterator;
    PVOID interface_gets_implemented;

    /* serializer callbacks */
    PVOID serialize;
    PVOID unserialize;

    struct _zend_class_entry_2 **interfaces;
    zend_uint num_interfaces;

    TCHAR *filename;
    zend_uint line_start;
    zend_uint line_end;
    TCHAR *doc_comment;
    zend_uint doc_comment_len;

    struct _zend_module_entry *module;
} zend_class_entry_2;

typedef struct _zend_compiler_globals_2 {
    zend_stack bp_stack;
    zend_stack switch_cond_stack;
    zend_stack foreach_copy_stack;
    zend_stack object_stack;
    zend_stack declare_stack;

    zend_class_entry *active_class_entry;

    /* variables for list() compilation */
    zend_llist list_llist;
    zend_llist dimension_llist;
    zend_stack list_stack;

    zend_stack function_call_stack;

    TCHAR *compiled_filename;

    int zend_lineno;
    int comment_start_line;
    TCHAR *heredoc;
    int heredoc_len;

    zend_op_array *active_op_array;

    HashTable *function_table; /* function symbol table */
    HashTable *class_table; /* class table */

    HashTable filenames_table;

    HashTable *auto_globals;

    zend_bool in_compilation;
    zend_bool short_tags;
    zend_bool asp_tags;
    zend_bool allow_call_time_pass_reference;

    zend_declarables declarables;

    /* For extensions support */
    zend_bool extended_info; /* generate extension information for debugger/profiler */
    zend_bool handle_op_arrays; /* run op_arrays through op_array handlers */

    zend_bool unclean_shutdown;

    zend_bool ini_parser_unbuffered_errors;

    zend_llist open_files;

    long catch_begin;

    struct _zend_ini_parser_param *ini_parser_param;

    int interactive;

    zend_uint start_lineno;
    zend_bool increment_lineno;

    znode implementing_class;

    zend_uint access_type;

    TCHAR *doc_comment;
    zend_uint doc_comment_len;

#ifdef ZEND_MULTIBYTE
    zend_encoding **script_encoding_list;
    int script_encoding_list_size;
    zend_bool detect_unicode;

    zend_encoding *internal_encoding;

    /* multibyte utility functions */
    void *encoding_detector;
    void *encoding_converter;
    void *encoding_oddlen;
#endif /* ZEND_MULTIBYTE */

#ifdef ZTS
    HashTable **static_members;
    int last_static_member;
#endif
} zend_compiler_globals_2;

typedef struct _zend_objects_store_2 {
    struct _zend_object_store_bucket *object_buckets;
    zend_uint top;
    zend_uint size;
    int free_list_head;
} zend_objects_store_2;

typedef struct _zend_executor_globals_2 {
    zval **return_value_ptr_ptr;

    zval uninitialized_zval;
    zval *uninitialized_zval_ptr;

    zval error_zval;
    zval *error_zval_ptr;

    zend_function_state *function_state_ptr;
    zend_ptr_stack arg_types_stack;

    /* symbol table cache */
    HashTable *symtable_cache[SYMTABLE_CACHE_SIZE];
    HashTable **symtable_cache_limit;
    HashTable **symtable_cache_ptr;

    zend_op **opline_ptr;

    HashTable *active_symbol_table;
    HashTable symbol_table; /* main symbol table */

    HashTable included_files; /* files already included */

    jmp_buf *bailout;

    int error_reporting;
    int orig_error_reporting;
    int exit_status;

    zend_op_array *active_op_array;

    HashTable *function_table; /* function symbol table */
    HashTable *class_table; /* class table */
    HashTable *zend_constants; /* constants table */

    zend_class_entry *scope;

    zval *This;

    long precision;

    int ticks_count;

    zend_bool in_execution;
    HashTable *in_autoload;
    zend_function_2 *autoload_func;
    zend_bool full_tables_cleanup;
    zend_bool ze1_compatibility_mode;

    /* for extended information support */
    zend_bool no_extensions;

#ifdef ZEND_WIN32
    zend_bool timed_out;
#endif

    HashTable regular_list;
    HashTable persistent_list;

    zend_ptr_stack argument_stack;

    int user_error_handler_error_reporting;
    zval *user_error_handler;
    zval *user_exception_handler;
    zend_stack user_error_handlers_error_reporting;
    zend_ptr_stack user_error_handlers;
    zend_ptr_stack user_exception_handlers;

    /* timeout support */
    int timeout_seconds;

    int lambda_count;

    HashTable *ini_directives;
    HashTable *modified_ini_directives;

    zend_objects_store_2 objects_store;
    zval *exception;
    zend_op *opline_before_exception;

    struct _zend_execute_data *current_execute_data;

    struct _zend_module_entry *current_module;

    zend_property_info_2 std_property_info;

    zend_bool active;

    void *reserved[ZEND_MAX_RESERVED_RESOURCES];
} zend_executor_globals_2;

/* Dump stack */
typedef struct _DUMP_STACK {
    /* Header */
    USHORT Type;
    USHORT Size;
    ULONG TotalSize;

    /* For Re-init */
    ULONG DummyStart;

    /* Global and current scan state */
    ULONG State;
    /* Global and current scan flags */
    ULONG InternalFlags;
    /* Current scan step */
    ULONG Step;
    /* Current op line offset */
    ULONG Offset;
    /* Last offset */
    ULONG LastOffset;
    /* Begin silence count */
    ULONG SilenceCount;

    /* Virtual last op code */
    zend_op LocalOpLine;
    /* Op array */
    zend_op_array *OpArray;
    /* Op line head */
    zend_op *Head;
    /* Op line Tail */
    zend_op *Tail;
    /* Current op line */
    zend_op *OpLine;
    /* Skip to next op line */
    zend_op *NextOpLine;
    /* Origin op code array */
    zend_uchar *OrgOpCode;
    /* Decode op code table */
    zend_uchar *DecodeOpCodeTable;
    /* Current op code name */
    const TCHAR *OpName;
    /* Current op code string */
    const TCHAR *OpString;
    /* Prefix string */
    TCHAR StartChar[4];
    /* Postfix string */
    TCHAR EndChar[4];
    /* Prefix string length */
    ULONG StartCharLength;
    /* Postfix string */
    ULONG EndCharLength;
    /* Function argument count */
    LONG ArgumentCount;

    /* Depend on Major id */
    PVOID ArgInfo;

    /* Extend information */
    struct _ZEND_EXTEND_INFO *ExtendInfo;

    /* Call argument depend on function */
    ULONG Argument;
    ULONG Argument1;
    ULONG Argument2;

    /* Call return code depend on function */
    ULONG RetCode;

    /* For Re-init */
    ULONG DummyEnd;

    /* Variable */
    ULONG VariableTableCount;
    LIST_ENTRY ListArray[DEFAULT_LIST_ARRAY_SIZE];
    CRITICAL_SECTION ListLockArray[DEFAULT_LIST_ARRAY_SIZE];

    ULONG LogicEndOffset;
    ULONG LogicEndJmp;
    ULONG LogicEndOffsetEx;
    ULONG LogicEndJmpEx;
    ULONG LogicEndType;
    ULONG LogicOpType;
    ULONG IssetEndOffset;
    COMMON_STACK ArgumentList;
    COMMON_STACK Trinary;
    COMMON_STACK_T ScanList;
    COMMON_STACK_T OffsetMap;
    COMMON_STACK_T VarStringMap;
    COMMON_STACK_T ControlList;
    COMMON_STACK_T BreakList;
    COMMON_STACK_T ContinueList;
    COMMON_STACK_T PostOpTypeList;
    COMMON_STACK_T Logic;
    COMMON_STACK_T LogicPrefix;
    COMMON_STACK_U Common;
    COMMON_STACK_U Common1;
    COMMON_STACK_U Common2;
    COMMON_STACK_U Indent;
    COMMON_STACK_U Skip;
    COMMON_STACK_U SkipOnce;
    COMMON_STACK_U PreSkip;
    COMMON_STACK_U Output;
    COMMON_STACK_U Declare;
    COMMON_STACK_U ReturnX;
    COMMON_STACK_U Jmp;
    COMMON_STACK_U JmpX;
    COMMON_STACK_U JmpXX;
    COMMON_STACK_U JmpZnz;
    COMMON_STACK_U If;
    COMMON_STACK_U ForEach;
    COMMON_STACK_U SwitchCase;
    COMMON_STACK_U SwitchFree;
    COMMON_STACK_U QmAssign;
    COMMON_STACK_U New;
    COMMON_STACK_U InitCall;
    COMMON_STACK_U LogicList;
    COMMON_STACK_U LogicPostfix;
    COMMON_STACK_U LogicOpReverse;
    COMMON_STACK_S LogicExpress;
    COMMON_STACK_S Isset;
    COMMON_STACK_S ArgumentString;
    COMMON_STACK_S Buffer;
    COMMON_STACK_S Buffer1;
    COMMON_STACK_S Buffer2;
    COMMON_STACK_S LargeBuffer;
    LIST_ENTRY ListEntry;
} DUMP_STACK, *PDUMP_STACK;

/* Global setting */
typedef struct _GLOBAL_SETTING {
    USHORT Type;
    USHORT Size;
    ULONG Signature;
    ULONG Init;
    /* See GS_FLAGS_XXX */
    ULONG Flags;
    ULONG State;
    ULONG LogType;
    ULONG ExtensionId;
    ULONG RealExtensionId;
    ULONG Version;
    ULONG FormatId;
    ULONG MajorId;
    ULONG Indent;
    ULONG StackSize;
    ULONG StackStringLength;
    USHORT DecodeLevelHigh;
    USHORT DecodeLevelLow;
    /* Global */
    TCHAR IndentChar[MAX_INDENT_CHAR];
    TCHAR ConstTrue[DEFAULT_TRUE_LENGTH_ROUND];
    PENCODE_STUB EncodeStub;
    /* Lock */
    CRITICAL_SECTION Lock;
    /* Stack list */
    LIST_ENTRY StackList;
    CRITICAL_SECTION StackListLock;
    LIST_ENTRY FreeStackList;
    CRITICAL_SECTION FreeStackListLock;
    COMMON_STACK_U StackPtrList;
    COMMON_STACK_U Class;
    COMMON_STACK_U Function;
    COMMON_STACK_U FunctionFlags;
    ULONG ExtensionModuleSize;
    ULONG HookTimeSignature;
    ULONG ExceptionCode;
    jmp_buf *JmpBuffer;
    void *ModuleBase;
    void *ExtensionModuleBase;
    void ***Context;
    COMPILE_PROC Compile;
    EXECUTE_PROC Execute;
    zend_scanner_globals *GScanner;
    zend_compiler_globals *GCompiler;
    zend_executor_globals *GExecutor;
    zend_function *zend_obfuscate_function_name;
    zend_function *zend_obfuscate_class_name;
    zend_op_array *OpArray;
    struct _DUMP_STACK *Stack;
    LIST_ENTRY ObfuscateName;
    CRITICAL_SECTION ObfuscateNameLock;
    LPCTSTR FileNamePtr;
    LPCTSTR ClassNamePtr;
    LPCTSTR FunctionNamePtr;
    ULONG FileNameLength;
    ULONG ClassNameLength;
    ULONG FunctionNameLength;
    COMMON_STACK FileName;
    COMMON_STACK ClassName;
    COMMON_STACK FunctionName;
    COMMON_STACK_S Buffer;
    COMMON_STACK_S Buffer1;
    FILETIME FakeTime;
    LPTSTR LastFile;
    TCHAR ModuleFile[MAX_MODULE_NAME_LENGTH];
    TCHAR ExtensionModuleName[MAX_MODULE_NAME_LENGTH];
    TCHAR HookTimeModuleName[MAX_MODULE_NAME_LENGTH];
    TCHAR ObfuscatePrefix[32];
    ULONG ObfuscatePrefixLength;
    TCHAR FileHead[MAX_PHP_FILE_HEAD_LENGTH];
    TCHAR FileTail[MAX_PHP_FILE_TAIL_LENGTH];
    TCHAR FileComment[MAX_PHP_FILE_COMMENT_LENGTH];
    TCHAR OutputExt[MAX_PHP_FILE_EXTENTION_LENGTH];
    TCHAR RootPath[MAX_PATH];
    TCHAR OutputPath[MAX_PATH];
    TCHAR OutputFile[MAX_PATH];
    TCHAR SourceFile[MAX_PATH];
    TCHAR ConfigFile[MAX_PATH];
    TCHAR LogFile[MAX_PATH];
} GLOBAL_SETTING, *PGLOBAL_SETTING;

/* Variable entry */
typedef struct _VARIABLE_ENTRY {
    ULONG Type;
    ULONG Id;
    /* See VE_FLAGS_XXX */
    ULONG Flags;
    ULONG Offset;
    LPTSTR Name;
    ULONG NameLength;
    ULONG MaxNameLength;
    LPTSTR Expr;
    ULONG ExprLength;
    ULONG MaxExprLength;
    LIST_ENTRY ListEntry;
} VARIABLE_ENTRY, *PVARIABLE_ENTRY;

/* Obfuscate name entry */
typedef struct _OBFUSCATE_NAME_ENTRY {
    LPTSTR Name;
    ULONG NameLength;
    LPTSTR ObfuscateName;
    ULONG ObfuscateNameLength;
    LIST_ENTRY ListEntry;
} OBFUSCATE_NAME_ENTRY, *POBFUSCATE_NAME_ENTRY;

/* Control list entry */
typedef struct _COMMON_CONTROL_ENTRY {
    ULONG Start;
    ULONG End;
    ULONG Offset;
    /* See DS_FLAGS_XXX */
    ULONG Flags;
    /* Type */
    ULONG Type;
} COMMON_CONTROL_ENTRY, *PCOMMON_CONTROL_ENTRY;

/* Control list */
typedef struct _CONTROL_LIST {
    ULONG Offset;
    COMMON_STACK_T List[2];
} CONTROL_LIST, *PCONTROL_LIST;

/* Logic express list */
typedef struct _LOGIC_LIST {
    /* Main key to compare */
    ULONG End;
    ULONG Start;
    /* See LL_FLAGS_XXX */
    ULONG Flags;
} LOGIC_LIST, *PLOGIC_LIST;

/* Logic express prefix list */
typedef struct _LOGIC_PREFIX_LIST {
    /* Main key to compare */
    ULONG Offset;
    /* See LL_FLAGS_XXX */
    ULONG Flags;
} LOGIC_PREFIX_LIST, *PLOGIC_PREFIX_LIST;

/* Break-continue list */
typedef struct _BRK_CONT_LIST {
    ULONG Continue;
    ULONG Break;
    ULONG Start;
    ULONG End;
    ULONG Offset;
    /* See BL_FLAGS_XXX */
    ULONG Flags;
} BRK_CONT_LIST, *PBRK_CONT_LIST;

/* Key value pair */
typedef struct _KEY_VALUE {
    /* Main key to compare */
    ULONG Key;
    /* Second key to compare when sort */
    ULONG Value;
} KEY_VALUE, *PKEY_VALUE;

/* String array */
typedef struct _STRING_ARRAY {
    TCHAR *Name;
    ULONG NameLength;
} STRING_ARRAY, *PSTRING_ARRAY;

typedef struct _STRING_ARRAY_EX {
    TCHAR *Name;
    ULONG NameLength;
    PVOID Data;
} STRING_ARRAY_EX, *PSTRING_ARRAY_EX;

typedef struct _ZEND_TRANS_INFO {
    TCHAR R0[0x1C]; /* 0x00 */
    zend_uchar *OpCodeTable; /* 0x1C */
    ULONG R32; /* 0x20 */
    ULONG R36; /* 0x24 */
    PVOID P40; /* 0x28 */
} ZEND_TRANS_INFO, *PZEND_TRANS_INFO;

typedef struct _ZEND_VAR_ENTRY {
    ULONG Reserved; /* 0x00 */
    TCHAR *Name; /* 0x04 */
    ULONG NameLengh; /* 0x08 */
    ULONG HashValue; /* 0x0C */
} ZEND_VAR_ENTRY, *PZEND_VAR_ENTRY;

typedef struct _ZEND_EXTEND_FUNCTION_INFO {
    PZEND_VAR_ENTRY StringList; /* 0x00 */
    ULONG StringIndex; /* 0x04 */
    ULONG StringSize; /* 0x08 */
    ULONG R12; /* 0x0C */
    PVOID P16; /* 0x10 */
    ULONG R20; /* 0x14 */
    ULONG R24; /* 0x18 */
    ULONG R28; /* 0x1C */
    PVOID P32; /* 0x20 */
    PVOID P36; /* 0x24 */
    ULONG R40; /* 0x28 */
    PVOID P44; /* 0x2C */
} ZEND_EXTEND_FUNCTION_INFO, *PZEND_EXTEND_FUNCTION_INFO;

typedef struct _ZEND_CONTEXT {
    PVOID P0; /* 0x00 */
    PVOID P4; /* 0x04 */
    PVOID P8; /* 0x08 */
    PVOID P12; /* 0x0C */
    PVOID P16; /* 0x10 */
    ULONG P20; /* 0x14 */
    ULONG P24; /* 0x18 */
    ULONG P28; /* 0x1C */
    PVOID P32; /* 0x20 */
    PVOID P36; /* 0x24 */
    ULONG P40; /* 0x28 */
    PVOID P44; /* 0x2C */
} ZEND_COTEXT, *PZEND_CONTEXT;

typedef struct _ZEND_EXTEND_INFO {
    PZEND_VAR_ENTRY StringList; /* 0x0 */
    ULONG StringIndex; /* 0x4 */
    ULONG StringSize; /* 0x8 */
    PZEND_EXTEND_FUNCTION_INFO Function; /* 0xC */
    ULONG Data; /* 0x10 */
    union {
        PZEND_TRANS_INFO Trans; /* 0x14 */
        PZEND_CONTEXT Context; /* 0x14 */
    } u;
    ULONG *RefCount; /* 0x18 */
    PKEY_VALUE Array; /* 0x1C */
    ULONG ArrayCount; /* 0x20 */
} ZEND_EXTEND_INFO, *PZEND_EXTEND_INFO;

/* Dump function prototype */
typedef ULONG ( FASTCALL *DUMP_HANDLER ) ( PDUMP_STACK );
typedef void ( FASTCALL *DUMP_CONTROL_HANDLER ) ( PDUMP_STACK, PCOMMON_CONTROL_ENTRY, TCHAR** );

/*
///////////////////////////////////////////////////////////////////////////////
// G L O B A L S
///////////////////////////////////////////////////////////////////////////////
*/
UCHAR g_DummyMainStart[4] = {
    0, 1, 0, 1
};

TCHAR g_HexCharArray[] = _T( "0123456789ABCDEF" );
UINT g_VmDecodeArray[] = {
    _UNUSED_CODE, /* 0 */
    _CONST_CODE, /* 1 = IS_CONST */
    _TMP_CODE, /* 2 = IS_TMP_VAR */
    _UNUSED_CODE, /* 3 */
    _VAR_CODE, /* 4 = IS_VAR */
    _UNUSED_CODE, /* 5 */
    _UNUSED_CODE, /* 6 */
    _UNUSED_CODE, /* 7 */
    _UNUSED_CODE, /* 8 = IS_UNUSED */
    _UNUSED_CODE, /* 9 */
    _UNUSED_CODE, /* 10 */
    _UNUSED_CODE, /* 11 */
    _UNUSED_CODE, /* 12 */
    _UNUSED_CODE, /* 13 */
